app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `last_request_at`, `crypted_password`, `updated_at`, `perishable_token`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `active`, `email`) VALUES('2010-08-24 08:28:02', NULL, '4895dadefce301a49515c65d7a8d2c25af3932c910f3650af8364da9673b8119d74160e67cdc5c56e932d29126abd0edd9393a0beaa6b83e68ea9618265da86f', '2010-08-24 08:28:02', 'y8SEg0YuXtjYVKI6iN6', NULL, 'sss17r6A2MPf5IL71Rii', NULL, '7df19de1bc38b69116c12043659cded9359cd6f5386303cb86624bb1ce5327416d7565b9509613ad4cfe5b62052c86f4cbb0b8a4ef1fe155ce599a82be18d443', 0, NULL, 'sachin', NULL, 0, 'sachin238@gmail.com')
---
  def create
    @user = User.new(params[:user])
    #@user.set_initial_state
    if @user.save_without_session_maintenance

SELECT * FROM `users` WHERE (perishable_token = 'WrwYjBpQ3zK3eJLJMP' and updated_at > '2010-08-17 08:34:07') LIMIT 1
---
  def activate
    @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)